app/controllers/sessions_controller.rb

SELECT "locales".* FROM "locales" WHERE "locales"."active" = $1  [["active", "t"]]
---
  def show

    user_id = nil

    # no valid sessions
    if session[:user_id]
      user_id = session[:user_id]
    end

    if !user_id
      # get models
      models = SessionHelper.models()

      render json: {
        error: 'no valid session',
        config: config_frontend,
        models: models,
        collections: {
          Locale.to_app_model => Locale.where(active: true)